/* automatically generated by rust-bindgen 0.72.1 */

pub const RLGL_VERSION: &[u8; 4] = b"6.0\0";
pub const RL_DEFAULT_BATCH_BUFFER_ELEMENTS: u32 = 8192;
pub const RL_DEFAULT_BATCH_BUFFERS: u32 = 1;
pub const RL_DEFAULT_BATCH_DRAWCALLS: u32 = 256;
pub const RL_DEFAULT_BATCH_MAX_TEXTURE_UNITS: u32 = 4;
pub const RL_MAX_MATRIX_STACK_SIZE: u32 = 32;
pub const RL_MAX_SHADER_LOCATIONS: u32 = 32;
pub const RL_CULL_DISTANCE_NEAR: f64 = 0.05;
pub const RL_CULL_DISTANCE_FAR: f64 = 4000.0;
pub const RL_TEXTURE_WRAP_S: u32 = 10242;
pub const RL_TEXTURE_WRAP_T: u32 = 10243;
pub const RL_TEXTURE_MAG_FILTER: u32 = 10240;
pub const RL_TEXTURE_MIN_FILTER: u32 = 10241;
pub const RL_TEXTURE_FILTER_NEAREST: u32 = 9728;
pub const RL_TEXTURE_FILTER_LINEAR: u32 = 9729;
pub const RL_TEXTURE_FILTER_MIP_NEAREST: u32 = 9984;
pub const RL_TEXTURE_FILTER_NEAREST_MIP_LINEAR: u32 = 9986;
pub const RL_TEXTURE_FILTER_LINEAR_MIP_NEAREST: u32 = 9985;
pub const RL_TEXTURE_FILTER_MIP_LINEAR: u32 = 9987;
pub const RL_TEXTURE_FILTER_ANISOTROPIC: u32 = 12288;
pub const RL_TEXTURE_MIPMAP_BIAS_RATIO: u32 = 16384;
pub const RL_TEXTURE_WRAP_REPEAT: u32 = 10497;
pub const RL_TEXTURE_WRAP_CLAMP: u32 = 33071;
pub const RL_TEXTURE_WRAP_MIRROR_REPEAT: u32 = 33648;
pub const RL_TEXTURE_WRAP_MIRROR_CLAMP: u32 = 34626;
pub const RL_MODELVIEW: u32 = 5888;
pub const RL_PROJECTION: u32 = 5889;
pub const RL_TEXTURE: u32 = 5890;
pub const RL_LINES: u32 = 1;
pub const RL_TRIANGLES: u32 = 4;
pub const RL_QUADS: u32 = 7;
pub const RL_UNSIGNED_BYTE: u32 = 5121;
pub const RL_FLOAT: u32 = 5126;
pub const RL_STREAM_DRAW: u32 = 35040;
pub const RL_STREAM_READ: u32 = 35041;
pub const RL_STREAM_COPY: u32 = 35042;
pub const RL_STATIC_DRAW: u32 = 35044;
pub const RL_STATIC_READ: u32 = 35045;
pub const RL_STATIC_COPY: u32 = 35046;
pub const RL_DYNAMIC_DRAW: u32 = 35048;
pub const RL_DYNAMIC_READ: u32 = 35049;
pub const RL_DYNAMIC_COPY: u32 = 35050;
pub const RL_FRAGMENT_SHADER: u32 = 35632;
pub const RL_VERTEX_SHADER: u32 = 35633;
pub const RL_COMPUTE_SHADER: u32 = 37305;
pub const RL_ZERO: u32 = 0;
pub const RL_ONE: u32 = 1;
pub const RL_SRC_COLOR: u32 = 768;
pub const RL_ONE_MINUS_SRC_COLOR: u32 = 769;
pub const RL_SRC_ALPHA: u32 = 770;
pub const RL_ONE_MINUS_SRC_ALPHA: u32 = 771;
pub const RL_DST_ALPHA: u32 = 772;
pub const RL_ONE_MINUS_DST_ALPHA: u32 = 773;
pub const RL_DST_COLOR: u32 = 774;
pub const RL_ONE_MINUS_DST_COLOR: u32 = 775;
pub const RL_SRC_ALPHA_SATURATE: u32 = 776;
pub const RL_CONSTANT_COLOR: u32 = 32769;
pub const RL_ONE_MINUS_CONSTANT_COLOR: u32 = 32770;
pub const RL_CONSTANT_ALPHA: u32 = 32771;
pub const RL_ONE_MINUS_CONSTANT_ALPHA: u32 = 32772;
pub const RL_FUNC_ADD: u32 = 32774;
pub const RL_MIN: u32 = 32775;
pub const RL_MAX: u32 = 32776;
pub const RL_FUNC_SUBTRACT: u32 = 32778;
pub const RL_FUNC_REVERSE_SUBTRACT: u32 = 32779;
pub const RL_BLEND_EQUATION: u32 = 32777;
pub const RL_BLEND_EQUATION_RGB: u32 = 32777;
pub const RL_BLEND_EQUATION_ALPHA: u32 = 34877;
pub const RL_BLEND_DST_RGB: u32 = 32968;
pub const RL_BLEND_SRC_RGB: u32 = 32969;
pub const RL_BLEND_DST_ALPHA: u32 = 32970;
pub const RL_BLEND_SRC_ALPHA: u32 = 32971;
pub const RL_BLEND_COLOR: u32 = 32773;
pub const RL_READ_FRAMEBUFFER: u32 = 36008;
pub const RL_DRAW_FRAMEBUFFER: u32 = 36009;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_POSITION: u32 = 0;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_TEXCOORD: u32 = 1;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_NORMAL: u32 = 2;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_COLOR: u32 = 3;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_TANGENT: u32 = 4;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_TEXCOORD2: u32 = 5;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_INDICES: u32 = 6;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_BONEINDICES: u32 = 7;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_BONEWEIGHTS: u32 = 8;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_INSTANCETRANSFORM: u32 = 9;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Matrix {
    pub m0: f32,
    pub m4: f32,
    pub m8: f32,
    pub m12: f32,
    pub m1: f32,
    pub m5: f32,
    pub m9: f32,
    pub m13: f32,
    pub m2: f32,
    pub m6: f32,
    pub m10: f32,
    pub m14: f32,
    pub m3: f32,
    pub m7: f32,
    pub m11: f32,
    pub m15: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Matrix"][::std::mem::size_of::<Matrix>() - 64usize];
    ["Alignment of Matrix"][::std::mem::align_of::<Matrix>() - 4usize];
    ["Offset of field: Matrix::m0"][::std::mem::offset_of!(Matrix, m0) - 0usize];
    ["Offset of field: Matrix::m4"][::std::mem::offset_of!(Matrix, m4) - 4usize];
    ["Offset of field: Matrix::m8"][::std::mem::offset_of!(Matrix, m8) - 8usize];
    ["Offset of field: Matrix::m12"][::std::mem::offset_of!(Matrix, m12) - 12usize];
    ["Offset of field: Matrix::m1"][::std::mem::offset_of!(Matrix, m1) - 16usize];
    ["Offset of field: Matrix::m5"][::std::mem::offset_of!(Matrix, m5) - 20usize];
    ["Offset of field: Matrix::m9"][::std::mem::offset_of!(Matrix, m9) - 24usize];
    ["Offset of field: Matrix::m13"][::std::mem::offset_of!(Matrix, m13) - 28usize];
    ["Offset of field: Matrix::m2"][::std::mem::offset_of!(Matrix, m2) - 32usize];
    ["Offset of field: Matrix::m6"][::std::mem::offset_of!(Matrix, m6) - 36usize];
    ["Offset of field: Matrix::m10"][::std::mem::offset_of!(Matrix, m10) - 40usize];
    ["Offset of field: Matrix::m14"][::std::mem::offset_of!(Matrix, m14) - 44usize];
    ["Offset of field: Matrix::m3"][::std::mem::offset_of!(Matrix, m3) - 48usize];
    ["Offset of field: Matrix::m7"][::std::mem::offset_of!(Matrix, m7) - 52usize];
    ["Offset of field: Matrix::m11"][::std::mem::offset_of!(Matrix, m11) - 56usize];
    ["Offset of field: Matrix::m15"][::std::mem::offset_of!(Matrix, m15) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlVertexBuffer {
    pub elementCount: ::std::os::raw::c_int,
    pub vertices: *mut f32,
    pub texcoords: *mut f32,
    pub normals: *mut f32,
    pub colors: *mut ::std::os::raw::c_uchar,
    pub indices: *mut ::std::os::raw::c_uint,
    pub vaoId: ::std::os::raw::c_uint,
    pub vboId: [::std::os::raw::c_uint; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlVertexBuffer"][::std::mem::size_of::<rlVertexBuffer>() - 72usize];
    ["Alignment of rlVertexBuffer"][::std::mem::align_of::<rlVertexBuffer>() - 8usize];
    ["Offset of field: rlVertexBuffer::elementCount"]
        [::std::mem::offset_of!(rlVertexBuffer, elementCount) - 0usize];
    ["Offset of field: rlVertexBuffer::vertices"]
        [::std::mem::offset_of!(rlVertexBuffer, vertices) - 8usize];
    ["Offset of field: rlVertexBuffer::texcoords"]
        [::std::mem::offset_of!(rlVertexBuffer, texcoords) - 16usize];
    ["Offset of field: rlVertexBuffer::normals"]
        [::std::mem::offset_of!(rlVertexBuffer, normals) - 24usize];
    ["Offset of field: rlVertexBuffer::colors"]
        [::std::mem::offset_of!(rlVertexBuffer, colors) - 32usize];
    ["Offset of field: rlVertexBuffer::indices"]
        [::std::mem::offset_of!(rlVertexBuffer, indices) - 40usize];
    ["Offset of field: rlVertexBuffer::vaoId"]
        [::std::mem::offset_of!(rlVertexBuffer, vaoId) - 48usize];
    ["Offset of field: rlVertexBuffer::vboId"]
        [::std::mem::offset_of!(rlVertexBuffer, vboId) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlDrawCall {
    pub mode: ::std::os::raw::c_int,
    pub vertexCount: ::std::os::raw::c_int,
    pub vertexAlignment: ::std::os::raw::c_int,
    pub textureId: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlDrawCall"][::std::mem::size_of::<rlDrawCall>() - 16usize];
    ["Alignment of rlDrawCall"][::std::mem::align_of::<rlDrawCall>() - 4usize];
    ["Offset of field: rlDrawCall::mode"][::std::mem::offset_of!(rlDrawCall, mode) - 0usize];
    ["Offset of field: rlDrawCall::vertexCount"]
        [::std::mem::offset_of!(rlDrawCall, vertexCount) - 4usize];
    ["Offset of field: rlDrawCall::vertexAlignment"]
        [::std::mem::offset_of!(rlDrawCall, vertexAlignment) - 8usize];
    ["Offset of field: rlDrawCall::textureId"]
        [::std::mem::offset_of!(rlDrawCall, textureId) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlRenderBatch {
    pub bufferCount: ::std::os::raw::c_int,
    pub currentBuffer: ::std::os::raw::c_int,
    pub vertexBuffer: *mut rlVertexBuffer,
    pub draws: *mut rlDrawCall,
    pub drawCounter: ::std::os::raw::c_int,
    pub currentDepth: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlRenderBatch"][::std::mem::size_of::<rlRenderBatch>() - 32usize];
    ["Alignment of rlRenderBatch"][::std::mem::align_of::<rlRenderBatch>() - 8usize];
    ["Offset of field: rlRenderBatch::bufferCount"]
        [::std::mem::offset_of!(rlRenderBatch, bufferCount) - 0usize];
    ["Offset of field: rlRenderBatch::currentBuffer"]
        [::std::mem::offset_of!(rlRenderBatch, currentBuffer) - 4usize];
    ["Offset of field: rlRenderBatch::vertexBuffer"]
        [::std::mem::offset_of!(rlRenderBatch, vertexBuffer) - 8usize];
    ["Offset of field: rlRenderBatch::draws"]
        [::std::mem::offset_of!(rlRenderBatch, draws) - 16usize];
    ["Offset of field: rlRenderBatch::drawCounter"]
        [::std::mem::offset_of!(rlRenderBatch, drawCounter) - 24usize];
    ["Offset of field: rlRenderBatch::currentDepth"]
        [::std::mem::offset_of!(rlRenderBatch, currentDepth) - 28usize];
};
pub const rlGlVersion_RL_OPENGL_SOFTWARE: rlGlVersion = 0;
pub const rlGlVersion_RL_OPENGL_11: rlGlVersion = 1;
pub const rlGlVersion_RL_OPENGL_21: rlGlVersion = 2;
pub const rlGlVersion_RL_OPENGL_33: rlGlVersion = 3;
pub const rlGlVersion_RL_OPENGL_43: rlGlVersion = 4;
pub const rlGlVersion_RL_OPENGL_ES_20: rlGlVersion = 5;
pub const rlGlVersion_RL_OPENGL_ES_30: rlGlVersion = 6;
pub type rlGlVersion = ::std::os::raw::c_uint;
pub const rlTraceLogLevel_RL_LOG_ALL: rlTraceLogLevel = 0;
pub const rlTraceLogLevel_RL_LOG_TRACE: rlTraceLogLevel = 1;
pub const rlTraceLogLevel_RL_LOG_DEBUG: rlTraceLogLevel = 2;
pub const rlTraceLogLevel_RL_LOG_INFO: rlTraceLogLevel = 3;
pub const rlTraceLogLevel_RL_LOG_WARNING: rlTraceLogLevel = 4;
pub const rlTraceLogLevel_RL_LOG_ERROR: rlTraceLogLevel = 5;
pub const rlTraceLogLevel_RL_LOG_FATAL: rlTraceLogLevel = 6;
